tests/unit/api_contract/_api_checker/test_verification_records/payment_verification.fixture.json

{
    "payment_verification": {
        "master": {
            "model": "payment.paymentverification",
            "pk": "bea5bcc8-7505-4548-ac80-2a7f7d983b4f",
            "fields": {
                "created_at": "2025-01-01T00:00:00Z",
                "updated_at": "2025-01-01T00:00:00Z",
                "version": 1735688653315200,
                "payment": "850b1399-80cb-4a12-a9c3-cafeeb3f28a9",
                "payment_verification_plan": "210d9a68-cb22-4d9f-8d48-d1a93bcf6c0a",
                "status": "PENDING",
                "status_date": "2025-01-01T00:00:00Z",
                "received_amount": null,
                "sent_to_rapid_pro": false
            }
        },
        "deps": [
            {
                "model": "payment.payment",
                "pk": "850b1399-80cb-4a12-a9c3-cafeeb3f28a9",
                "fields": {
                    "is_removed": false,
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "unicef_id": "RCPT-BA0000-25-0.000.001",
                    "signature_hash": "661d491b42d5967a0dab6d974be64b43352adaf2",
                    "internal_data": {},
                    "parent": "53aa5007-9444-4e1b-8638-238467bf9807",
                    "parent_split": null,
                    "business_area": "1b0efa46-8582-45c7-9975-cf8d0866c9cd",
                    "program": null,
                    "household": "567ee8d3-de6e-4c93-96f6-a3384ecaf22a",
                    "head_of_household": null,
                    "delivery_type": null,
                    "financial_service_provider": null,
                    "collector": "f117a19d-aae5-4f1c-8b95-cd5be9a49f83",
                    "collector_type": "PRIMARY",
                    "source_payment": null,
                    "is_follow_up": false,
                    "status": "Pending",
                    "status_date": "2025-01-01T00:00:00Z",
                    "currency": 164,
                    "entitlement_quantity": null,
                    "entitlement_quantity_usd": null,
                    "entitlement_date": null,
                    "delivered_quantity": null,
                    "delivered_quantity_usd": null,
                    "delivery_date": null,
                    "transaction_reference_id": null,
                    "transaction_status_blockchain_link": null,
                    "conflicted": false,
                    "excluded": false,
                    "has_valid_wallet": true,
                    "reason_for_unsuccessful_payment": null,
                    "order_number": null,
                    "token_number": null,
                    "additional_collector_name": null,
                    "additional_document_type": null,
                    "additional_document_number": null,
                    "fsp_auth_code": null,
                    "extras": {},
                    "vulnerability_score": null,
                    "is_cash_assist": false,
                    "sent_to_fsp_date": null
                }
            },
            {
                "model": "payment.paymentplan",
                "pk": "53aa5007-9444-4e1b-8638-238467bf9807",
                "fields": {
                    "is_removed": false,
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "version": 1735688653315203,
                    "unicef_id": "PP-BA0000-25-00000001",
                    "internal_data": {},
                    "business_area": "1b0efa46-8582-45c7-9975-cf8d0866c9cd",
                    "program_cycle": "be73adc2-f5e5-4668-a5b5-a545e2d696bb",
                    "payment_plan_group": "1de593d9-b329-4bde-bb69-d80aa72b6c35",
                    "delivery_mechanism": null,
                    "financial_service_provider": null,
                    "imported_file": null,
                    "export_file_entitlement": null,
                    "export_file_delivery": null,
                    "export_pdf_file_summary": null,
                    "reconciliation_import_file": null,
                    "steficon_rule": null,
                    "steficon_rule_targeting": null,
                    "created_by": "fd191659-3918-4075-896f-99338ab6ba5a",
                    "closed_by": null,
                    "closure_comment": null,
                    "source_payment_plan": null,
                    "follow_up_instruction": null,
                    "storage_file": null,
                    "name": null,
                    "start_date": null,
                    "end_date": null,
                    "currency": null,
                    "dispersion_start_date": "2025-01-01",
                    "dispersion_end_date": "2025-01-31",
                    "excluded_ids": null,
                    "exclusion_reason": null,
                    "vulnerability_score_min": null,
                    "vulnerability_score_max": null,
                    "abort_comment": "",
                    "flat_amount_value": null,
                    "status": "FINISHED",
                    "background_action_status": null,
                    "build_status": null,
                    "built_at": null,
                    "exchange_rate": null,
                    "custom_exchange_rate": false,
                    "use_payment_gateway": false,
                    "custom_exchange_rate_set_by": null,
                    "female_children_count": 0,
                    "male_children_count": 0,
                    "female_adults_count": 0,
                    "male_adults_count": 0,
                    "total_households_count": 0,
                    "total_individuals_count": 0,
                    "imported_file_date": null,
                    "total_entitled_quantity": null,
                    "total_entitled_quantity_usd": null,
                    "total_entitled_quantity_revised": null,
                    "total_entitled_quantity_revised_usd": null,
                    "total_delivered_quantity": null,
                    "total_delivered_quantity_usd": null,
                    "total_undelivered_quantity": null,
                    "total_undelivered_quantity_usd": null,
                    "steficon_targeting_applied_date": null,
                    "steficon_applied_date": null,
                    "plan_type": "REGULAR",
                    "export_tag": null,
                    "exclude_household_error": null,
                    "status_date": "2025-01-01T00:00:00Z",
                    "is_cash_assist": false,
                    "flag_exclude_if_active_adjudication_ticket": false,
                    "flag_exclude_if_on_sanction_list": false,
                    "payment_plan_purposes": [
                        "d4abd590-1ae8-4164-8e29-c688ae25743d"
                    ]
                }
            },
            {
                "model": "core.businessarea",
                "pk": "1b0efa46-8582-45c7-9975-cf8d0866c9cd",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "code": "BA0000",
                    "slug": "business-area-0",
                    "name": "Business Area 0",
                    "long_name": "Business Area 0 Long Name",
                    "parent": null,
                    "office_country": null,
                    "is_split": false,
                    "region_code": "64",
                    "region_name": "TEST",
                    "has_data_sharing_agreement": false,
                    "is_accountability_applicable": false,
                    "rdi_import_xlsx_disabled": false,
                    "active": true,
                    "enable_email_notification": true,
                    "kobo_username": null,
                    "kobo_token": null,
                    "kobo_url": null,
                    "rapid_pro_host": null,
                    "rapid_pro_payment_verification_token": null,
                    "rapid_pro_messages_token": null,
                    "rapid_pro_survey_token": null,
                    "postpone_deduplication": false,
                    "ingest_source": "ALL_EXCEPT_COUNTRY_WORKSPACE",
                    "deduplication_duplicate_score": 6.0,
                    "deduplication_possible_duplicate_score": 6.0,
                    "deduplication_batch_duplicates_percentage": 50,
                    "deduplication_batch_duplicates_allowed": 5,
                    "deduplication_golden_record_duplicates_percentage": 50,
                    "deduplication_golden_record_duplicates_allowed": 5,
                    "deduplication_ignore_withdraw": false,
                    "biometric_deduplication_threshold": 0.0,
                    "custom_fields": {},
                    "countries": [],
                    "payment_countries": []
                }
            },
            {
                "model": "program.programcycle",
                "pk": "be73adc2-f5e5-4668-a5b5-a545e2d696bb",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "version": 1735688653315202,
                    "unicef_id": "PC-BA0000-25-000001",
                    "title": "Programme Cycle 0",
                    "program": "ec46309a-59d6-47ce-8317-65664040174c",
                    "status": "ACTIVE",
                    "start_date": "2025-01-01",
                    "end_date": null,
                    "created_by": null
                }
            },
            {
                "model": "program.program",
                "pk": "ec46309a-59d6-47ce-8317-65664040174c",
                "fields": {
                    "is_removed": false,
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "last_sync_at": null,
                    "version": 1735688653315206,
                    "data_collecting_type": 6,
                    "beneficiary_group": "8865a0ea-d359-40ef-bfbf-eeb426b68597",
                    "business_area": "1b0efa46-8582-45c7-9975-cf8d0866c9cd",
                    "name": "Program 0",
                    "code": "lpz9",
                    "status": "ACTIVE",
                    "description": "",
                    "start_date": "2025-01-01",
                    "end_date": "2026-01-01",
                    "sector": "MULTI_PURPOSE",
                    "budget": "1000000.00",
                    "frequency_of_payments": "ONE_OFF",
                    "scope": null,
                    "partner_access": "SELECTED_PARTNERS_ACCESS",
                    "cash_plus": false,
                    "population_goal": 1000,
                    "administrative_areas_of_implementation": "",
                    "biometric_deduplication_enabled": false,
                    "collision_detector": "hope.apps.program.collision_detectors.NoopCollisionDetector",
                    "identification_key_individual_label": null,
                    "is_visible": true,
                    "household_count": 0,
                    "individual_count": 0,
                    "reconciliation_window_in_days": 0,
                    "send_reconciliation_window_expiry_notifications": false,
                    "admin_areas": [],
                    "sanction_lists": [],
                    "payment_plan_purposes": [
                        "d4abd590-1ae8-4164-8e29-c688ae25743d"
                    ]
                }
            },
            {
                "model": "core.datacollectingtype",
                "pk": 6,
                "fields": {
                    "created": "2025-01-01T00:00:00Z",
                    "modified": "2025-01-01T00:00:00Z",
                    "code": "dct_0",
                    "label": "DCT 0",
                    "type": "STANDARD",
                    "description": "",
                    "active": true,
                    "deprecated": false,
                    "individual_filters_available": false,
                    "household_filters_available": true,
                    "recalculate_composition": false,
                    "weight": 0,
                    "compatible_types": [
                        6
                    ],
                    "limit_to": []
                }
            },
            {
                "model": "program.beneficiarygroup",
                "pk": "8865a0ea-d359-40ef-bfbf-eeb426b68597",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "name": "Group 0",
                    "group_label": "Household",
                    "group_label_plural": "Households",
                    "member_label": "Individual",
                    "member_label_plural": "Individuals",
                    "master_detail": true
                }
            },
            {
                "model": "payment.paymentplanpurpose",
                "pk": "d4abd590-1ae8-4164-8e29-c688ae25743d",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "unicef_id": "PPP-13",
                    "name": "Purpose 0",
                    "description": "",
                    "limit_to": []
                }
            },
            {
                "model": "payment.paymentplangroup",
                "pk": "1de593d9-b329-4bde-bb69-d80aa72b6c35",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "unicef_id": "PPG-11",
                    "cycle": "be73adc2-f5e5-4668-a5b5-a545e2d696bb",
                    "name": "Default Group",
                    "delivery_import_file": null,
                    "background_action_status": null
                }
            },
            {
                "model": "account.user",
                "pk": "fd191659-3918-4075-896f-99338ab6ba5a",
                "fields": {
                    "password": "",
                    "last_login": null,
                    "is_superuser": true,
                    "username": "user_0",
                    "first_name": "",
                    "last_name": "",
                    "is_staff": true,
                    "is_active": true,
                    "date_joined": "2025-01-01T00:00:00Z",
                    "azure_id": null,
                    "display_name": "user_0",
                    "status": "INVITED",
                    "partner": 16,
                    "email": "user_0@example.com",
                    "custom_fields": {},
                    "job_title": "",
                    "last_modify_date": "2025-01-01T00:00:00Z",
                    "groups": [],
                    "user_permissions": []
                }
            },
            {
                "model": "account.partner",
                "pk": 16,
                "fields": {
                    "name": "Partner 0",
                    "parent": null,
                    "is_un": false,
                    "lft": 1,
                    "rght": 2,
                    "tree_id": 2,
                    "level": 0,
                    "allowed_business_areas": []
                }
            },
            {
                "model": "household.household",
                "pk": "567ee8d3-de6e-4c93-96f6-a3384ecaf22a",
                "fields": {
                    "rdi_merge_status": "MERGED",
                    "is_removed": false,
                    "removed_date": null,
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "last_sync_at": null,
                    "version": 1735688653315204,
                    "unicef_id": "HH-25-0000.0004",
                    "internal_data": {},
                    "business_area": "1b0efa46-8582-45c7-9975-cf8d0866c9cd",
                    "program": "ec46309a-59d6-47ce-8317-65664040174c",
                    "registration_data_import": "1d69cc90-42c1-4ffb-a2fe-a12029335ce1",
                    "household_collection": null,
                    "storage_obj": null,
                    "copied_from": null,
                    "country_origin": null,
                    "country": null,
                    "admin1": null,
                    "admin2": null,
                    "admin3": null,
                    "admin4": null,
                    "head_of_household": "f117a19d-aae5-4f1c-8b95-cd5be9a49f83",
                    "facility": null,
                    "consent_sign": "",
                    "consent": null,
                    "consent_sharing": "",
                    "residence_status": "",
                    "address": "",
                    "zip_code": null,
                    "size": null,
                    "female_age_group_0_5_count": null,
                    "female_age_group_6_11_count": null,
                    "female_age_group_12_17_count": null,
                    "female_age_group_18_59_count": null,
                    "female_age_group_60_count": null,
                    "pregnant_count": null,
                    "male_age_group_0_5_count": null,
                    "male_age_group_6_11_count": null,
                    "male_age_group_12_17_count": null,
                    "male_age_group_18_59_count": null,
                    "male_age_group_60_count": null,
                    "female_age_group_0_5_disabled_count": null,
                    "female_age_group_6_11_disabled_count": null,
                    "female_age_group_12_17_disabled_count": null,
                    "female_age_group_18_59_disabled_count": null,
                    "female_age_group_60_disabled_count": null,
                    "male_age_group_0_5_disabled_count": null,
                    "male_age_group_6_11_disabled_count": null,
                    "male_age_group_12_17_disabled_count": null,
                    "male_age_group_18_59_disabled_count": null,
                    "male_age_group_60_disabled_count": null,
                    "children_count": null,
                    "male_children_count": null,
                    "female_children_count": null,
                    "children_disabled_count": null,
                    "male_children_disabled_count": null,
                    "female_children_disabled_count": null,
                    "other_sex_group_count": null,
                    "unknown_sex_group_count": null,
                    "returnee": null,
                    "fchild_hoh": null,
                    "child_hoh": null,
                    "village": "",
                    "currency": null,
                    "unhcr_id": "",
                    "detail_id": null,
                    "originating_id": null,
                    "start": null,
                    "registration_method": "",
                    "family_id": null,
                    "origin_unicef_id": null,
                    "is_migration_handled": false,
                    "migrated_at": null,
                    "collect_type": "STANDARD",
                    "program_registration_id": null,
                    "total_cash_received_usd": null,
                    "total_cash_received": null,
                    "flex_fields": {},
                    "first_registration_date": "2025-01-01T00:00:00Z",
                    "last_registration_date": "2025-01-01T00:00:00Z",
                    "withdrawn": false,
                    "withdrawn_date": null,
                    "longitude": null,
                    "latitude": null,
                    "deviceid": "",
                    "name_enumerator": "",
                    "org_enumerator": "",
                    "org_name_enumerator": "",
                    "kobo_submission_uuid": null,
                    "kobo_submission_time": null,
                    "enumerator_rec_id": null,
                    "flex_registrations_record_id": null,
                    "identification_key": null,
                    "extra_rdis": []
                }
            },
            {
                "model": "registration_data.registrationdataimport",
                "pk": "1d69cc90-42c1-4ffb-a2fe-a12029335ce1",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "version": 1735688653315202,
                    "name": "RDI 0",
                    "status": "MERGED",
                    "business_area": "1b0efa46-8582-45c7-9975-cf8d0866c9cd",
                    "program": "ec46309a-59d6-47ce-8317-65664040174c",
                    "import_date": "2025-01-01T00:00:00Z",
                    "imported_by": "c098e3dd-8130-4225-bce9-82fb6b483ba1",
                    "data_source": "XLS",
                    "import_data": null,
                    "import_from_ids": null,
                    "exclude_external_collectors": false,
                    "pull_pictures": true,
                    "screen_beneficiary": false,
                    "excluded": false,
                    "erased": false,
                    "refuse_reason": null,
                    "error_message": "",
                    "sentry_id": "",
                    "number_of_individuals": 1,
                    "number_of_households": 1,
                    "batch_duplicates": 0,
                    "batch_possible_duplicates": 0,
                    "batch_unique": 0,
                    "golden_record_duplicates": 0,
                    "golden_record_possible_duplicates": 0,
                    "golden_record_unique": 0,
                    "dedup_engine_batch_duplicates": 0,
                    "dedup_engine_golden_record_duplicates": 0,
                    "country_workspace_id": null
                }
            },
            {
                "model": "account.user",
                "pk": "c098e3dd-8130-4225-bce9-82fb6b483ba1",
                "fields": {
                    "password": "",
                    "last_login": null,
                    "is_superuser": false,
                    "username": "user_1",
                    "first_name": "",
                    "last_name": "",
                    "is_staff": false,
                    "is_active": true,
                    "date_joined": "2025-01-01T00:00:00Z",
                    "azure_id": null,
                    "display_name": "user_1",
                    "status": "INVITED",
                    "partner": 18,
                    "email": "user_1@example.com",
                    "custom_fields": {},
                    "job_title": "",
                    "last_modify_date": "2025-01-01T00:00:00Z",
                    "groups": [],
                    "user_permissions": []
                }
            },
            {
                "model": "account.partner",
                "pk": 18,
                "fields": {
                    "name": "Partner 1",
                    "parent": null,
                    "is_un": false,
                    "lft": 1,
                    "rght": 2,
                    "tree_id": 3,
                    "level": 0,
                    "allowed_business_areas": []
                }
            },
            {
                "model": "household.individual",
                "pk": "f117a19d-aae5-4f1c-8b95-cd5be9a49f83",
                "fields": {
                    "rdi_merge_status": "MERGED",
                    "is_removed": false,
                    "removed_date": null,
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "last_sync_at": null,
                    "version": 1735688653315202,
                    "unicef_id": "IND-25-0000.0005",
                    "internal_data": {},
                    "business_area": "1b0efa46-8582-45c7-9975-cf8d0866c9cd",
                    "program": "ec46309a-59d6-47ce-8317-65664040174c",
                    "registration_data_import": "1d69cc90-42c1-4ffb-a2fe-a12029335ce1",
                    "household": "567ee8d3-de6e-4c93-96f6-a3384ecaf22a",
                    "individual_collection": null,
                    "copied_from": null,
                    "individual_id": "",
                    "photo": "",
                    "full_name": "Person 0",
                    "given_name": "",
                    "middle_name": "",
                    "family_name": "",
                    "sex": "MALE",
                    "birth_date": "1990-01-01",
                    "estimated_birth_date": false,
                    "marital_status": "",
                    "phone_no": "",
                    "phone_no_alternative": "",
                    "email": "",
                    "payment_delivery_phone_no": null,
                    "relationship": "",
                    "work_status": "NOT_PROVIDED",
                    "pregnant": null,
                    "fchild_hoh": false,
                    "child_hoh": false,
                    "disability": "not disabled",
                    "observed_disability": "NONE",
                    "disability_certificate_picture": "",
                    "seeing_disability": "",
                    "hearing_disability": "",
                    "physical_disability": "",
                    "memory_disability": "",
                    "selfcare_disability": "",
                    "comms_disability": "",
                    "who_answers_phone": "",
                    "who_answers_alt_phone": "",
                    "preferred_language": null,
                    "relationship_confirmed": false,
                    "wallet_name": "",
                    "blockchain_name": "",
                    "wallet_address": "",
                    "duplicate": false,
                    "duplicate_date": null,
                    "withdrawn": false,
                    "withdrawn_date": null,
                    "flex_fields": {},
                    "phone_no_valid": false,
                    "phone_no_alternative_valid": false,
                    "first_registration_date": "2025-01-01",
                    "last_registration_date": "2025-01-01",
                    "enrolled_in_nutrition_programme": null,
                    "deduplication_golden_record_status": "UNIQUE",
                    "deduplication_batch_status": "UNIQUE_IN_BATCH",
                    "deduplication_golden_record_results": {},
                    "deduplication_batch_results": {},
                    "biometric_deduplication_golden_record_status": "NOT_PROCESSED",
                    "biometric_deduplication_batch_status": "NOT_PROCESSED",
                    "biometric_deduplication_golden_record_results": [],
                    "biometric_deduplication_batch_results": [],
                    "imported_individual_id": null,
                    "sanction_list_possible_match": false,
                    "sanction_list_confirmed_match": false,
                    "detail_id": null,
                    "originating_id": null,
                    "country_workspace_id": null,
                    "program_registration_id": null,
                    "age_at_registration": null,
                    "origin_unicef_id": null,
                    "is_migration_handled": false,
                    "migrated_at": null,
                    "identification_key": null,
                    "vector_column": "'0':3 'none':1 'person':2"
                }
            },
            {
                "model": "core.currency",
                "pk": 164,
                "fields": {
                    "code": "PLN",
                    "name": "Polish Zloty",
                    "is_crypto": false,
                    "vision_code": "PLN",
                    "active": true,
                    "number_of_decimals": 2
                }
            },
            {
                "model": "payment.paymentverificationplan",
                "pk": "210d9a68-cb22-4d9f-8d48-d1a93bcf6c0a",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "version": 1735688653315200,
                    "unicef_id": "PVP-1",
                    "payment_plan": "53aa5007-9444-4e1b-8638-238467bf9807",
                    "status": "PENDING",
                    "verification_channel": "MANUAL",
                    "sampling": "FULL_LIST",
                    "sex_filter": null,
                    "activation_date": null,
                    "completion_date": null,
                    "sample_size": null,
                    "responded_count": null,
                    "received_count": null,
                    "not_received_count": null,
                    "received_with_problems_count": null,
                    "confidence_interval": null,
                    "margin_of_error": null,
                    "rapid_pro_flow_id": "",
                    "rapid_pro_flow_start_uuids": "[]",
                    "xlsx_file_exporting": false,
                    "xlsx_file_imported": false,
                    "error": null,
                    "age_filter": null,
                    "excluded_admin_areas_filter": null
                }
            }
        ]
    }
}